<template>
  <main>
    <div class="w-full flex justify-center align-middle mt-14">
    <h1 class ="text-xl">В проектах старалась использовать современное оборудование (коммутаторы различных модификаций преобразователи интерфейсов (Cisco, Moxa), контроллеры ячеек, многофункциональные контроллеры, преобразователи (Энергосервис, Прософт системы, Системы связи и телемеханики, Team R).

В связи с вынужденным переездом в Братск моя жизнь сильно изменилась. Компания, в которую я первоначально планировала устроиться на работу неожиданно отказала мне в трудоустройстве уже после того, как я получила оффер от них, в связи с конфликтом интересов ( в одном из подразделений уже работал мой муж). Из-за этого в моей трудовой деятельности произошел перерыв длительностью более года

За время поиска работы по своей основной профессии я успела получить дополнительное образование дистанционно (веб-разработка, создание сайтов Яндекс-Практикум). Данный опыт показал, я неплохо учусь, могу осваивать новое (программирование это не шутки, из 600 человек поступивших учиться в моей группе окончили и получили диплом 60 человек, в том числе и я, чем я очень горжусь. Это не только про интеллект, а даже в гораздо большей степени про трудолюбие и упорство).
    </h1>
  </div>
  </main>
 
</template>
<!-- 
<style lang="scss">
.about {
  display: flex;
  justify-content: center;
  align-self: center;
  min-height: 100vh;
  align-items: center;
  @media (min-width: 1024px) {
    min-height: 100vh;

   
  }
}
</style> -->
