<template>
  <main>
    
    <section
      class="mt-14 bg-slate-100 bg-opacity-50 rounded-md box-border px-2 flex flex-col items-center"
    >
   
      <h3
        class="text-red-900 text-xl w-fit sm:text-3xl md:text-4xl pb-10 font-bold text-center pt-10 font-mono"
      >
        Школа плетения из лозы
      </h3>

      <article class="grid grid-cols-1 md:grid-cols-2 md:grid-rows-[fit-content,_fit-content]  gap-1 sm:gap-2 md:gap-14 flex-wrap justify-center">
        <div
          class=""
        >
          <img
            src="../assets/20240212_110846.jpg"
            class="w-[160px] h-[200px] sm:w-[250px] sm:h-[312px] object-cover object-bottom mr-6  float-right"
          />
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 "
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
        </div>
        <div
          class=""
        >
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-2 col-end-2 row-start-1 row-end-1"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
          <img
            src="../assets/20240212_111218.jpg"
            class="w-[160px] h-[200px] sm:w-[250px] sm:h-[312px] object-cover object-bottom ml-6 col-span-1 row-span-1 float-left"
          />
          <!-- <iframe
            src="https://yandex.ru/map-widget/v1/?um=constructor%3A2fc7174eaf54f4c9cb7bffcec7c9a18ea8cb8e812a5f5c50c85edbbfab0a71a7&amp;source=constructor"
            width="350"
            height="275"
            frameborder="0"
            class=" sm:w-[250px] sm:h-[312px] object-cover object-bottom ml-6 col-span-1 row-span-1 float-right"
          ></iframe> -->
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
         
        </div>
        <div
          class=""
        >
       
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-2 col-end-2 row-start-1 row-end-1"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
        
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
         
         
        </div>
        <div
          class=""
        >
          <img
            src="../assets/20240212_110846.jpg"
            class="w-[160px] h-[200px] sm:w-[250px] sm:h-[312px] object-cover object-bottom mr-6 col-span-1 row-span-1 float-right"
          />
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-2 col-end-2 row-start-1 row-end-1"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
        </div>

        <!-- <p class="text-base lg:text-lg text-black font-mono max-w-[fit-content] sm:max-w-[280px]  md:max-w-[300px] min-[900px]:max-w-[380px] lg:max-w-[450px] xl:max-w-[550px] 2xl:max-w-[700px] ">
      Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно
      сплести из обычной лозы. Однако натуральной лозе есть интересная и гораздо
      более бюджетная альтернатива — лоза бумажная или, говоря проще, бумажные
      трубочки. Несмотря на то, что исходный материал не отличается особой
      прочностью, благодаря обработке трубочки получаются гибкими и на удивление
      крепкими. Из них можно точно так же плести корзины, предметы декора, а
      также шляпы, сумки. Некоторые рукодельницы устраивают своим произведениям
      нешуточные испытания — например, держат корзины из бумажной лозы на улице.
      Если вы всё сделали правильно, прочность изделий вас не разочарует!
    </p> -->
        
      </article>
    </section>
  </main>
</template>
<!-- 
<style lang="scss">
.about {
  display: flex;
  justify-content: center;
  align-self: center;
  min-height: 100vh;
  align-items: center;
  @media (min-width: 1024px) {
    min-height: 100vh;

   
  }
}
</style> -->
