<template>
  <main>
    <section
      class="mt-14 bg-slate-100 bg-opacity-50 rounded-md box-border px-2 flex flex-col items-center"
    >
      <h3
        class="text-red-900 text-xl w-fit sm:text-3xl md:text-4xl pb-10 font-bold text-center pt-10 font-mono"
      >
        Школа плетения из лозы
      </h3>

      <article
        class="grid grid-cols-1 md:grid-cols-2 md:grid-rows-[fit-content,_fit-content] gap-1 sm:gap-2 md:gap-14 flex-wrap justify-center box-border p-1 sm:p-2 md:p-14"
      >
        <div class="flex flex-col items-center min-[1300px]:block">
          <img
            src="../assets/20240212_110846.jpg"
            class=" w-[320px] h-[400px] min-[1300px]:w-[240px] min-[1300px]:h-[300px]  object-cover object-bottom  float-right   min-[1300px]:ml-6 "
          />
          <p class="text-lg  text-black font-mono gap-1">
            Наша команда - пять мастериц. Самая опытная из нас - Ольга Осокина это преподаватель
            школы плетения. Мы прешли к ней ученицами-неумехами. Теперь мы сами делаем изделия
            высокого качества, и продаем их через наш магазин. Ольга, конечно, создает плетеные
            изделия намного более сложные в исполнении, чем можем мы, и шедевры ее работы Вы тоже
            можете купить у нас.   Школа начиналась как небольшой кружок по интересам. Приходилось снимать помещение -
            учебный класс в Православной гимназии города Братск.   Мы учились плести из эко-лозы.
            Ольга училась "учить".
          </p>
          <!-- <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Школа начиналась как небольшой кружок по интересам. Приходилось снимать помещение -
            учебный класс в Православной гимназии города Братскю Мы учились плести из эко-лозы.
            Ольга училась "учить". Теперь она дипломированный преподаватель. Может обучать своему
            ремеслу детей и взрослых. Мы же с гордостью можем сказать, теперь и мы мастерицы.
            Обучение плетению пользуется большой популярностью, это интрересный и полезный досуг.
            Школа похорошела, переехала в отдельное, специально подготовленное помещение. Мы теперь
            задумывааемся о том, чтобы продавать базовые уроки через интернет. Ведь попробовать
            плести хочется каждому, так почему не сделать это доступным для посетителей нашего
            сайта?
          </p> -->
        </div>
        <div class="flex flex-col items-center min-[1300px]:block">
          <img
            src="../assets/20240212_111218.jpg"
            class="w-[320px] h-[400px] min-[1300px]:w-[240px] min-[1300px]:h-[300px]  object-cover object-bottom  float-right   min-[1300px]:ml-6 "
          />
          <p
            class="text-lg  text-black font-mono gap-1 col-start-2 col-end-2 row-start-1 row-end-1"
          >
            Теперь она дипломированный преподаватель. Может обучать своему
            ремеслу детей и взрослых. Мы же с гордостью можем сказать, теперь и мы мастерицы.
            Обучение плетению пользуется большой популярностью, это интрересный и полезный досуг.
            Школа похорошела, переехала в отдельное, специально подготовленное помещение. Мы теперь
            задумывааемся о том, чтобы продавать базовые уроки через интернет. Ведь попробовать
            плести хочется каждому, так почему не сделать это доступным для посетителей нашего
            сайта?
          </p>
         
          <!-- <iframe
            src="https://yandex.ru/map-widget/v1/?um=constructor%3A2fc7174eaf54f4c9cb7bffcec7c9a18ea8cb8e812a5f5c50c85edbbfab0a71a7&amp;source=constructor"
            width="350"
            height="275"
            frameborder="0"
            class=" sm:w-[250px] sm:h-[312px] object-cover object-bottom ml-6 col-span-1 row-span-1 float-right"
          ></iframe> -->
          <!-- <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            К праздникам мы делаем скидки на многие товары из нашего каталога. Каждое наше изделие
            индифидуально и неповторимо.Если изделия какого-то артикула у нас нет в наличии, Вы
            всегда можете оформить индивидуальный заказ по номеру телефона: +7960769%%%%. В этом
            случае придется подождать немного дольше, чем время доставки по почте, ведь изделие
            сделают специально для Вас.
          </p>
        </div>
        <div class="">
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-2 col-end-2 row-start-1 row-end-1"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>

          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p>
          <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p> -->
        </div>
        <div class="flex flex-col items-center sm:block md:col-span-2">
          <img
            src="../assets/20240308_104412.jpg"
            class="w-[320px] h-[244px] object-cover object-top sm:ml-6  float-right"
          />
          <p
            class="text-lg text-black font-mono gap-1 col-start-2 col-end-2 row-start-1 row-end-1"
          >
             Наши работы выставлены в разделе "Магазин". Вы пожете приобрести их. Для покупки товаров
            Вам нужно зарегестрироваться на нашем сайте.После успешного оформления заказа, письмо с
            данными заказа приходит к нам (и к Вам) на электронную почту, наш специалист уточнит
            данные заказа, и в дальнейшем заказ будет отправлен Вам Почтой России по адресу,
            указанному в заказе. Стоимость доставки в Ваш регион можно увидеть в разделе "Доставка"
            нашего сайта, она плюсуется к стоимости заказа. Желаем Вам приятных покупок!!!
          
          </p>
          <!-- <p
            class="text-base lg:text-lg text-black font-mono gap-1 col-start-1 col-end-2 row-start-2 row-end-2"
          >
            Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно сплести из
            обычной лозы. Однако натуральной лозе есть интересная и гораздо более бюджетная
            альтернатива — лоза бумажная или, говоря проще, бумажные трубочки. Несмотря на то, что
            исходный материал не отличается особой прочностью, благодаря обработке трубочки
            получаются гибкими и на удивление крепкими. Из них можно точно так же плести корзины,
            предметы декора, а также шляпы, сумки. Некоторые рукодельницы устраивают своим
            произведениям нешуточные испытания — например, держат корзины из бумажной лозы на улице.
            Если вы всё сделали правильно, прочность изделий вас не разочарует!
          </p> -->
        </div>

        <!-- <p class="text-base lg:text-lg text-black font-mono max-w-[fit-content] sm:max-w-[280px]  md:max-w-[300px] min-[900px]:max-w-[380px] lg:max-w-[450px] xl:max-w-[550px] 2xl:max-w-[700px] ">
      Все мы знаем, какие прекрасные предметы интерьера, мебель, корзины можно
      сплести из обычной лозы. Однако натуральной лозе есть интересная и гораздо
      более бюджетная альтернатива — лоза бумажная или, говоря проще, бумажные
      трубочки. Несмотря на то, что исходный материал не отличается особой
      прочностью, благодаря обработке трубочки получаются гибкими и на удивление
      крепкими. Из них можно точно так же плести корзины, предметы декора, а
      также шляпы, сумки. Некоторые рукодельницы устраивают своим произведениям
      нешуточные испытания — например, держат корзины из бумажной лозы на улице.
      Если вы всё сделали правильно, прочность изделий вас не разочарует!
    </p> -->
      </article>
    </section>
  </main>
</template>
<!-- 
<style lang="scss">
.about {
  display: flex;
  justify-content: center;
  align-self: center;
  min-height: 100vh;
  align-items: center;
  @media (min-width: 1024px) {
    min-height: 100vh;

   
  }
}
</style> -->
